app/views/lists/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE ("tasks".list_id = 1)
---
 <%# <ul> %>
  <% @list.tasks.incomplete.each do |task| %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed" = 'f' AND ("tasks".list_id = 1)
---
<%#<ul id="completed"> %>
  <% @list.tasks.completed.each do |task| %>