app/views/tasks/list_all_tasks.html.erb

SELECT "tasks".* FROM "tasks"
---

 <% @tasks = Task.all %>