app/controllers/galleries_controller.rb

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = 1 LIMIT 1

  def edit
    @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = 1 LIMIT 1

  def create
    @gallery = Gallery.new(params[:gallery])

    respond_to do |format|
      if @gallery.save
---
INSERT INTO "galleries" ("name", "created_at", "updated_at") VALUES (NULL, '2012-05-01 08:19:27.922830', '2012-05-01 08:19:27.922830')

  def update
    @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = 1 LIMIT 1

  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = 1 LIMIT 1
DELETE FROM "galleries" WHERE "galleries"."id" = 1