app/controllers/lists_controller.rb

  def index
    respond_with(@lists = List.all)
---
SELECT "lists".* FROM "lists"

  def create
    @list = List.new(params[:list])
    if @list.save
---
INSERT INTO "lists" ("name", "description", "created_at", "updated_at") VALUES ('test', 'test', '2011-09-15 18:27:23.047468', '2011-09-15 18:27:23.047468')

  def update
    @list = List.find(params[:id])
    if @list.update_attributes(params[:list])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 1 LIMIT 1
UPDATE "lists" SET "name" = 'Home new', "description" = 'Things to do at new home', "updated_at" = '2011-09-16 06:19:45.914249' WHERE "lists"."id" = 1

  def destroy
    @list = List.find(params[:id])
    if @list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 1 LIMIT 1
DELETE FROM "lists" WHERE "lists"."id" = 1