app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def list_all_tasks
    respond_with(@tasks = Task.all)