app/controllers/tasks_controller.rb

  def create
    @task = @list.tasks.new(params[:task])

    if @task.save
---
INSERT INTO "tasks" ("description", "completed", "list_id", "created_at", "updated_at", "date") VALUES ('get toiletries', 'f', 1, '2011-09-19 10:12:46.314745', '2011-09-19 10:12:46.314745', NULL)

  def complete
    @task = @list.tasks.find(params[:id])
    @task.completed = true
    @task.save
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 AND ("tasks".list_id = 1) LIMIT 1
UPDATE "tasks" SET "completed" = 't', "updated_at" = '2011-09-17 23:22:51.509914' WHERE "tasks"."id" = 1

  def destroy
    puts "Call to destroy"
    @task = @list.tasks.find(params[:id])
    if @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 77 AND ("tasks".list_id = 1) LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 77

  def index
    puts "inside index.....1"
    if params[:search]
      @search = params[:search]
      puts "inside index.....2"
      puts @search
      @task = @list.tasks
      puts "@list.length #{@list}"
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks".list_id = 1) AND (description LIKE '%college%')

def search
    puts "inside index.....1"
    if params[:search]
      puts "inside index.....2"
      @tasks = @list.tasks.find(params[:list_id])
      puts "@List.length #{@list}"
---
SELECT "tasks".* FROM "tasks"

  def find_list
      @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 1 LIMIT 1